app/controllers/api/v1/users_controller.rb

  def index
  	users = User.all.paginate(:page => params[:page], :per_page => 3)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]

  def create
  	user = User.new(user_params)
  	if user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "albert12"], ["last_name", "einstein21"], ["email", "ae11@relativity.com"], ["created_at", "2021-10-27 12:10:21.203749"], ["updated_at", "2021-10-27 12:10:21.203749"]]

  def update
  	if @user.update_attributes(user_params)
---
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "test22"], ["updated_at", "2021-10-27 12:11:13.712379"], ["id", 6]]

  def destroy
  	if @user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]

  def typeahead
    @users = User.where("email like ? or first_name like ? or last_name like ? ", "%#{params[:input]}%", "%#{params[:input]}%", "%#{params[:input]}%")
---
SELECT  "users".* FROM "users" WHERE (email like '%gal%' || first_name like '%gal%' || last_name like '%gal%' ) LIMIT ?  [["LIMIT", 11]]

  def get_user
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]